; Laser Weapons item localization 
; this includes schematics, as of 13 Oct 2015 update
; this includes ability descriptor, as of 5 Jan 2016 update
; this includes techs, as of 12 March 2016 update

[AssaultRifle_LS X2WeaponTemplate]
FriendlyName="Pulse Rifle"
FriendlyNamePlural="Pulse Rifles"
BriefSummary="The Pulse Rifle emits a series of microsecond-duration blasts of light that destroy chemical bonds in targets."
TacticalText="<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades recovered from ADVENT enemies to improve the laser rifles's tactical effectiveness.\n<Bullet/> The high-energy output of these laser weapons is derived from integrating alien technology into discovered pre-war laser weaponry."
AbilityDescName="assault rifle"

[SMG_LS X2WeaponTemplate]
FriendlyName="Pulse Stengun"
FriendlyNamePlural="Pulse Stenguns"
BriefSummary="A lightweight version of the Pulse Rifle, this fills a similar role to the SMG, trading power, ammo and accuracy at range for increased soldier mobility and concealment."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades recovered from ADVENT enemies to improve the Stengun's tactical effectiveness. \n<Bullet/> SMG-style weapons offer bonus mobility, close-quarters accuracy and concealment relative to assault rifles, but they do less damage, have less ammo, and suffer accuracy penalties at long range."
AbilityDescName="SMG"

[Cannon_LS X2WeaponTemplate]
FriendlyName="Pulse Cannon"
FriendlyNamePlural="Pulse Cannons"
BriefSummary="Pulse weapons tech combined with an improved cooling system will let us deploy a rapid-fire version of the cannon, able to lay down a much deadlier volume of fire."
TacticalText="<Bullet/> The Pulse Cannon is a much more powerful, yet equally deployable, version of the Mag Cannon.\n<Bullet/> Use upgrades looted from enemies to improve the Pulse Cannon's tactical effectiveness."
AbilityDescName="cannon"

[Shotgun_LS X2WeaponTemplate]
FriendlyName="Scatter Blaster"
FriendlyNamePlural="Scatter Blaster"
BriefSummary="The Scatter Blaster is an application of pulse laser technology to provide shotgun-like effects; it is most effective at close range due to beam diffusion."
TacticalText="<Bullet/> Shotgun-style weapons are extremely effective at close range, but their accuracy drops off quickly at longer range.\n<Bullet/> Use upgrades looted from enemies to improve the Scatter Blaster's tactical effectiveness."
AbilityDescName="shotgun"

[SniperRifle_LS X2WeaponTemplate]
FriendlyName="Pulse Lance"
FriendlyNamePlural="Pulse Lances"
BriefSummary="A long rifle version of the Pulse Rifle, the Pulse Lance incorporates extremely high-energy flash capacitors, resulting in a high-precision long-range laser weapon."
TacticalText="Sniper rifles always require both actions to fire.\n<Bullet/> They are less accurate at close range, but deadly at a distance.\n<Bullet/> Use upgrades looted from enemies to improve the Pulse Lance's tactical effectiveness."
AbilityDescName="sniper rifle"

[Pistol_LS X2WeaponTemplate]
FriendlyName="Pulse Pistol"
FriendlyNamePlural="Pulse Pistols"
BriefSummary="A compact pulser that may be used as a sidearm."
TacticalText="<Bullet/> Pulse pistols are moderately more effective than Mag Pistols.\n<Bullet/> Pistols may be fired with a single action."
AbilityDescName="pistol"

[LaserWeaponsTech_LW X2TechTemplate]
DisplayName="Pulse Laser Weapons"
Summary="Using our new understanding of magnetism and the alien elerium substance, we should be able develop designs for powerful laser weaponry."
CodeName="Linebacker"
LongDescription="By studying the methods used by the aliens to manage energy consumption and heat dissipation in their weapons, we've built a working prototype of what we're calling a pulsed laser weapon, although some of the troops prefer to call them 'blasters' for reasons that are obscure to me. The power we are able to put through these weapons is immense, but the system cannot maintain a continuous beam of such immense energies, so it insted relies on a series of picosecond-long pulses of intense energy density to break down any chemical bonds the beam encounters. These weapons should do more damage, on average, than the magnetic weapons we have previously developed, although they don't quite match the plasma-beam devices we have seen the aliens operating. R. Tygan."

[AdvancedLaserWeaponsTech_LW X2TechTemplate]
DisplayName="Advanced Pulse Lasers"
Summary="With the basics of pulse laser technology fully understood, we believe we can now develop specialized pulse laser weapons for the troops."
CodeName="Fulcrum"
LongDescription="With a fuller understanding of pulse weapon technology thanks to feedback from the troops and the engineering team, we were able to refine our pulse weapon designs with a variety of changes to optics, pulse rate and capacitors to develop a series of specialty weapons usable in a variety of roles in the field. R. Tygan."
